Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/debt_relief_notices.html.txt.tmx
Source language: en
Languages: ga

source: • If your net income (after tax, PRSI and Universal Social Charge) increases by €400 or more per month, you must surrender half of that increase to the ISI as well
ga: • Má thagann méadú €400 nó níos mó ar do ghlanioncam (tar éis cánach, ÁSPC agus an Mhuirir Shóisialta Uilíoch) sa mhí, ní mór duit an leath den mhéadú sin a thabhairt don ISI chomh maith

source: Any amounts surrendered to the Insolvency Service will be distributed to the relevant creditors in proportion to the size of the debts that you owe to each creditor
ga: Déanfar aon mhéid a thugtar suas don tSeirbhís Dócmhainneachta a leithdháileadh ar na creidiúnaithe ábhartha i gcomhréir le méid an fhiachais atá le híoc agat le gach creidiúnaí

source: If you manage to repay half of the total debts covered by the Debt Relief Notice, then you no longer have to pay any further money and the DRN will end successfully
ga: Má éiríonn leat leath d’iomlán an fhiachais atá cuimsithe ag an bhFógra um Fhaoiseamh Fiachais a aisíoc, ní gá duit aon airgead breise a íoc agus cuirfear deireadh rathúil leis an DRN

source: At the end of the supervision period (or if you have managed to pay 50% or more of your debts) the Debt Relief Notice will cease to have effect
ga: Ag deireadh na tréimhse maoirseachta (nó má d'éirigh leat 50% nó níos mó de d’fhiachas a íoc), ní bheidh feidhm a thuilleadh ag an bhFógra um Fhaoiseamh Fiachais

source: You will be discharged from the debts it covered and any interest or penalties on those debts
ga: Díscaoilfear thú ón bhfiachas a chuimsigh sé agus aon ús nó pionóis ar an bhfiachas sin

source: All of the information about your DRN will be removed from the public Register of Debt Relief Notices and you will be given a Debt Relief Certificate, confirming that you have been discharged from the relevant debts
ga: Bainfear an fhaisnéis uile faoi do DRN ón gClár poiblí Fógraí um Fhaoiseamh Fiachais agus tabharfar Deimhniú um Fhaoiseamh Fiachais duit, a dheimhníonn gur díscaoileadh thú ón bhfiachas ábhartha

source: The ISI will also write to all the creditors concerned, to tell them that the Debt Relief Notice has been removed from the Register
ga: Ina theannta sin, scríobhfaidh an ISI chuig na creidiúnaithe go léir lena mbaineann, le hinsint dóibh gur baineadh an Fógra um Fhaoiseamh Fiachais ón gClár

source: Extension or unsuccessful ending of a DRN
ga: Síneadh nó deireadh mí-rathúil a chur le DRN

source: In certain circumstances, the Debt Relief Notice may be amended or terminated, enforcement orders may be issued, or the supervision period may be extended
ga: Faoi chúinsí áirithe, féadtar an Fógra um Fhaoiseamh Fiachais a leasú nó deireadh a chur leis, féadtar orduithe forfheidhmithe a eisiúint, nó féadtar an tréimhse mhaoirseachta a shíneadh

source: The main situations in which this can happen are:
ga: Is iad na príomhchásanna inar féidir leis seo tarlú:

source: • If the ISI concludes that you have failed to disclose an improvement in your financial position during the supervision period, the Circuit Court can make an order for enforcement, extend the period of the DRN, amend the DRN or make other orders or directions
ga: • Má bhíonn sé ina chonclúid ag an ISI gur theip ort feabhsú a nochtadh ar do staid airgeadais le linn na tréimhse maoirseachta, féadfaidh an Chúirt Chuarda ordú a dhéanamh ar fhorfheidhmiú, tréimhse an DRN a shíneadh, an DRN a leasú nó orduithe nó treoracha eile a dhéanamh

source: • If you or one of your creditors are aggrieved by something the Insolvency Service has done (or not done) and apply to the Circuit Court, the court may decide to revoke a decision of the ISI or make an order as above
ga: • Má tá tú féin nó duine de do chuid creidiúnaithe éagóirithe ag rud éigin a rinne (nó nach ndearna) an tSeirbhís Dócmhainneachta agus má dhéanann tú/siad iarratas ar an gCúirt Chuarda, féadfaidh an Chúirt a chinneadh chun cinneadh an ISI a chúlghairm nó ordú a dhéanamh amhail a shonraítear thuas

source: • If it turns out that you have given incomplete or false information, were not originally eligible for a DRN, have failed to surrender money to the ISI (50% of increased income or lump sum) or are otherwise in breach of your DRN obligations, the court can make orders as above or can decide to terminate the DRN
ga: • Má tharlaíonn sé gur thug tú faisnéis neamhiomlán nó bhréagach, mura raibh tú i dteideal DRN a fháil ar an gcéad dul síos, má theip ort airgead a thabhairt suas don ISI (50% den ioncam nó den chnapshuim) nó má sháraíonn tú do chuid dualgais DRN, féadfaidh an chúirt orduithe a dhéanamh, amhail a shonraítear thuas, nó féadtar a chinneadh chun deireadh a chur leis an DRN

source: If your Debt Relief Notice is terminated by the Court, you will be liable to pay all the unpaid debts that it had covered (unless the Court orders otherwise) along with any arrears, charges and interest that built up during the supervision period
ga: Má chuireann an Chúirt deireadh le d’Fhógra um Fhaoiseamh Fiachais, beidh tú faoi dhliteanas íoc as an bhfiachas go léir nár íocadh a bhí cumhdaithe aige (mura n-ordaíonn an Chúirt a mhalairt) mar aon le haon riaráistí, muirir agus ús a cruthaíodh le linn na tréimhse maoirseachta

source: How do I get a Debt Relief Notice?
ga: Conas a fhaighim Fógra um Fhaoiseamh Fiachais?

source: You must apply through an Approved Intermediary (AI) – see How to apply below
ga: Ní mór duit iarratas a dhéanamh trí Idirghabhálaí Faofa (AI) - féach 'Conas iarratas a dhéanamh' thíos

source: You must disclose all details of your financial affairs to the AI, who will then advise you whether or not you meet the conditions for a DRN, the consequences, and any alternative options
ga: Ní mór duit gach sonra faoi do chuid gnóthaí airgeadais a nochtadh don AI, a chuirfidh comhairle ansin ort cibé acu an gcomhlíonann nó nach gcomhlíonann tú na coinníollacha le haghaidh DRN, na hiarmhairtí, aon roghanna breise, agus na táillí (más ann dóibh) a d’fhéadfadh bheith ort a íoc

source: If you decide go ahead and apply for a DRN, you must confirm your intention in writing
ga: Má chinneann tú chun leanúint ar aghaidh agus iarratas a dhéanamh ar DRN, ní mór duit a chur i scríbhinn go mbeartaíonn tú amhlaidh a dhéanamh

source: You will have to complete a Prescribed Financial Statement (PFS), giving full and honest information about your financial circumstances
ga: Beidh ort Ráiteas Forordaithe Airgeadais (PFS) a chomhlíonadh, ina dtugtar faisnéis iomlán agus ionraic faoi do chuid cúinsí airgeadais

source: You must act in good faith and co-operate fully with the process
ga: Ní mór duit gníomhú le hintinn mhaith agus comhoibriú go hiomlán leis an bpróiseas

source: You will have to allow access to certain personal data held by banks and other financial institutions so that your financial situation can be verified
ga: Beidh ort rochtain a cheadú ar roinnt sonraí pearsanta atá á gcoinneáil ag bainc agus ag institiúidí airgeadais eile ionas gur féidir do staid airgeadais a fhíorú

source: Government departments and agencies will have the power to release certain information about you
ga: Beidh sé de chumhacht ag ranna agus gníomhaireachtaí an Rialtais faisnéis áirithe fút a scaoileadh

source: The AI will help you to complete the Prescribed Financial Statement and will then process your application if they consider that:
ga: Cabhróidh an AI leat chun an Ráiteas Forordaithe Airgeadais a chomhlánú agus próiseálfaidh sé/sí d'iarratas duit ansin má mheasann siad:

source: • You meet the eligibility conditions
ga: • Go gcomhlíonann tú na coinníollacha incháilitheachta

source: • The information in your PFS is complete and accurate in all material respects - you must confirm this by making a statutory declaration **
ga: • Go bhfuil an fhaisnéis i do PFS comhiomlán agus cruinn – ní mór duit é seo a dheimhniú trí dhearbhú reachtúil a dhéanamh**

source: ** A statutory declaration is a solemn statement which must be signed in the presence of someone who is authorised to witness statutory declarations – such as a practising solicitor, a Peace Commissioner, a notary public or a Commissioner for Oaths
ga: **Ráiteas sollúnta is ea dearbhú reachtúil nach mór a shíniú i láthair duine atá údaraithe le bheith mar fhinné ar dhearbhuithe reachtúla – ar nós aturnae cleachtach, Coimisinéir Síochána, nótaire poiblí nó Coimisinéir Mionnaí

source: The ISI has published detailed information on fees
ga: D’fhoilsigh an ISI faisnéis mhionsonraithe faoi tháillí

source: A fee of €100 was payable to the ISI for applying for a DRN
ga: Bhíodh táille €100 iníoctha leis an ISI as iarratas a dhéanamh ar DRN

source: When the AI is satisfied that you are eligible for a Debt Relief Notice and that all the information you have provided is complete and accurate, they will sign a statement saying so
ga: Nuair a bhíonn an AI sásta go bhfuil tú i dteideal Fógra um Fhaoiseamh Fiachais a fháil agus go bhfuil an fhaisnéis go léir a sholáthair tú comhiomlán agus cruinn, síneoidh siad ráiteas ina ndearbhaítear amhlaidh

source: The AI will then transmit your application, including all the details of your financial affairs and your debts, to the Insolvency Service to have a DRN approved
ga: Ansin aistreoidh an AI d’iarratas, lena n-áirítear sonraí uile do ghnóthaí airgeadais agus d'fhiachais, chuig an tSeirbhís Dócmhainneachta go ndéanfar DRN a fhaomhadh

source: When considering your application, the Insolvency Service can ask the AI for further information and will also have power to enquire into anything it considers relevant to verify the completeness and accuracy of your application
ga: Agus breithniú á dhéanamh ar d'iarratas, féadfaidh an tSeirbhís Dócmhainneachta iarraidh ar an AI ar bhreis faisnéise agus beidh sé de chumhacht acu aon rud a fhiosrú a mheasann siad is gá le hiomláine agus le cruinneas d’iarratais a dheimhniú

source: It can request information about your bank accounts, assets, liabilities, employment and income, and the Act states that anyone asked for such information (your bank, employer etc.) “shall furnish the information requested as soon as practicable”
ga: Féadfaidh siad faisnéis faoi do chuntais bhainc, sócmhainní, dliteanais, fostaíocht agus ioncam a iarraidh, agus luaitear san Acht, má iarrtar ar aon duine (do bhanc, d’fhostóir etc.) an fhaisnéis sin a thabhairt, “soláthrófar an fhaisnéis a lorgaíodh a luaithe agus is féidir”

source: Government departments, the Revenue Commissioners and other State bodies can also provide relevant information to the ISI about your financial circumstances
ga: Sa mhullach air sin, féadfaidh ranna Rialtais, na Coimisinéirí Ioncaim agus comhlachtaí Stáit eile faisnéis ábhartha a sholáthar don ISI faoi do chúinsí airgeadais

source: If the ISI considers that the application is in order, it will issue a certificate to that effect and notify the Circuit Court
ga: Má mheasann an ISI go bhfuil an t-iarratas in ord, eiseoidh siad deimhniú ina leith sin agus cuirfidh siad an Chúirt Chuarda ar an eolas

source: The court will review the application and documentation and, if satisfied that the conditions are met, will issue a Debt Relief Notice
ga: Déanfaidh an chúirt athbhreithniú ar an iarratas agus ar an gcáipéisíocht, agus, má tá siad sásta gur comhlíonadh na coinníollacha, eiseoidh siad Fógra um Fhaoiseamh Fiachais

source: The Court will notify the Insolvency Service, the AI, yourself and the relevant creditor(s) of the DRN
ga: Cuirfidh an Chúirt an tSeirbhís Dócmhainneachta, an AI, tú féin agus an creidiúnaí/na creidiúnaithe ábhartha ar an eolas faoin DRN

source: The DRN will relate to specific debts and specific creditors
ga: Bainfidh an DRN le fiachas sonracha agus le creidiúnaithe sonracha

source: You may well have other debts that are not covered by the DRN and those creditors are not affected by it
ga: Tharlódh go bhfuil fiachas eile agat nach gcumhdaíonn an DRN agus ní dhéanann sé aon difear do na creidiúnaithe siúd

source: The Insolvency Service will publish details of the DRN on the Register of Debt Relief Notices, which is accessible to the public
ga: Foilseoidh an tSeirbhís Dócmhainneachta sonraí faoin DRN ar Chlár Fógraí um Fhaoiseamh Fiachais, a mbeidh rochtain ag an bpobal orthu

source: Your application for a Debt Relief Notice must be made through an Approved Intermediary (AI)
ga: Ní mór d’iarratas ar Fhógra um Fhaoiseamh Fiachais a dhéanamh trí Idirghabhálaí Faofa

source: You can choose an AI from the Register of Approved Intermediaries that is published by the ISI
ga: Is féidir Idirghabhálaí Faofa a roghnú ó Chlár na nIdirghabhálaithe Faofa

source: The majority of Money Advice and Budgeting Services (MABS) have been authorised as AIs
ga: Tá formhór na Seirbhísí Bhuiséadta agus Chomhairle Airgid (MABS) ceadaithe mar Idirghabhálaithe Faofa

source: The MABS Helpline provides an initial checking service to check if you satisfy the eligibility criteria for a DRN
ga: Cuireann Líne Chabhrach MABS seirbhís seiceála ar fáil chun a sheiceáil ar dtús an sásaíonn tú na critéir le haghaidh DRN

source: Before contacting the MABS Helpline for this eligibility check, you will need to assemble all the relevant information about your debts, assets, income and circumstances
ga: Sula chuireann tú glao ar Líne Chabhrach MABS le haghaidh na seirbhíse seo, ba cheart duit gach eolas a chuimsiú maidir le d'fhiachais, do shócmhainni agus do chúinsí uile

source: The MABS Helpline is at 0761 07 2000, Monday to Friday from 9 am to 8 pm
ga: Tá Líne Chabhrach MABS ar 0761 07 2000, ó Luan go hAoine, idir 9rn agus 8in

source: Read more on the MABS website
ga: Léigh tuilleadh ar láithreán MABS

source: Further information is available from the ISI’s helpline 0761 06 4200 (Monday to Friday, 9 am to 6 pm) and from its main website isi.gov.ie, as well as its website backontrack.ie for people who are struggling with debt
ga: Tá fáil ar bhreis faisnéise ó líne chabhrach an ISI, 0761 06 4200, ó Luan go hAoine, idir 9rn agus 6in, óna láithreán gréasáin, isi.gov.ie agus ón láithrean backontrack.ie, atá dírithe ar dhaoine a bhfuil fadhbanna fiachais acu
